{
    "courses": [
      {
        "code": "COMPSCI101",
        "title": "Principles of Programming",
        "description": "An introductory paper on the fundamentals of programming and computer science. The course covers variables, expressions, input and output, control structures, functions, simple data structures and modules – these concepts are introduced and applied practically with Python.",
        "projects": ""
      },
      {
        "code": "COMPSCI111",
        "title": "An Introduction to Practical Computing",
        "description": "A practical introduction to computers, hardware and software fundamentals. The course covers a general overview of computing concepts, with a focus on web design, operating systems, history of the internet, basic programming concepts and the social impact of technology.",
        "projects": ""
    },
    {
        "code": "COMPSCI105",
        "title": "Principles of Computer Science",
        "description": "An extension course that carries forward the knowledge gained in CompSci101, with an emphasis on code etiquette through understanding the significance of code reability/efficiency and data structures. More complex programming concepts are introduced, such as arrays, recursion, lists, stacks, queues and hash tables. ",
        "projects": ""
    },
    {
        "code": "COMPSCI210",
        "title": "Computer Systems 1",
        "description": "A paper that aims to explore computer and systems architecture that is used within modern day computing. The course attempts to look at the intermediary interface layer that is used to communicate between the computer hardware and software. Topics such as data representation, a history of computer architecture, logic circuits, assembly language programming and C programming syntax are covered. ",
        "projects": ""
    },
    {
        "code": "COMPSCI220",
        "title": "Algorithms and Data Structures",
        "description": "An introductory course concerning the analysis of algorithm and data structures within computer science. The course covers topics such as time complexity, sorting and searching algorithms, graph optimisation and string matching techniques. ",
        "projects": ""
    },
    {
        "code": "COMPSCI225",
        "title": "Discrete Structures in Mathematics and Computer Science",
        "description": "An introduction to logic, counting principles, mathematical induction, graphs, trees and algorithms. A more mathematical approach to some of the concepts covered in that of CompSci220, placing more of an emphasis on mathematical proofs and logic based thinking.",
        "projects": ""
    },
    {
        "code": "COMPSCI230",
        "title": "Programming Techniques",
        "description": "An introduction to object-oriented and concurrent programming. Through Java programming applications, fundamental skills in object-oriented software development, GUI programming and application-level multithreading are covered.",
        "projects": ""
    },
    {
        "code": "COMPSCI335",
        "title": "Functional Programming and Distributed Services",
        "description": "A specialised course around functional programming for data integration, distributed services and browser based applications, specifically; REST architectures, security, and performance. Coursework included web-application building, XML/JSON schema testing and pen-testing exercises.",
        "projects": ""
    },
    {
        "code": "COMPSCI340",
        "title": "Operating Systems",
        "description": "A paper designed for understanding the intricacies of operating systems from the perspective of both programmer and program designer. Topics such as distributed computing, embedded devices, virtual machines/virtualisation, efficiency and scalability and parallelisation.",
        "projects": ""
    },
    {
        "code": "COMPSCI345",
        "title": "Human-computer Interaction",
        "description": "A course designed at examining human behaviour and expectations, computer interfaces and the interaction between the two. Usability design principles and human centred design concepts are emphasised, exploring the ideas of those such as Don Norman, Jakob Nielsen and John Maeda concerning human experiences with technology.",
        "projects": ""
    },
    {
        "code": "COMPSCI361",
        "title": "Machine Learning",
        "description": "An introductory course on the basics of machine learning and its application within artificial intelligence. Topics included basic concepts such as data bias, overfitting/underfitting models, applications of ML algorithms on a problem and learning to accurately obtain and interpret the results.",
        "projects": ""
    },
    {
        "code": "COMPSCI373",
        "title": "Computer Graphics and Image Processing",
        "description": "An introduction to the fundamentals of image processing and computer graphics, useful for the analysis and processing of image data and for the reconstruction of realistic 3 dimensional model rendering. The course covered topics like graphics primitives, lighting and shading, texture mapping, ray tracing, character animation and curve and surface design. In addition, image processing fundamentals are presented such as image definition and representation, perception and colour models, grey level and colour enhancement, neighbourhood operations and filtering. ",
        "projects": ""
    },
    {
        "code": "GEOG102",
        "title": "Geography of the Human Environment",
        "description": "An introductory course to geographic approaches to environmental, economic, cultural and social processes as they impact on social patterns of human development and resource use at regional, national and international levels. The relationships among processes and their geographic outcomes are explored through discussion of social geographies of difference, uneven environmental development, cultural geography and the environment, and geographies of the built environment.",
        "projects": ""
    },
    {
        "code": "GEOG202",
        "title": "Cities, Regions & Communities",
        "description": "A paper that acts to explore changes in contemporary urban societies and explains these using core concepts and methods in human geography. Concepts regarding standard techniques for analysing social and economic change are introduced, with a focus on interpreting and understanding social and economic data to make accurate observations in regards to cultural processes.",
        "projects": ""
    },
    {
        "code": "GEOG205",
        "title": "Environment and Society",
        "description": "A course that provides a critical exploration of the interconnectedness of environment and society. This paper highlights the importance of understanding how different views and attitudes influence people's interactions with the environment. Key themes include governance, management and development, which are addressed through issues such as conservation, climate change adaptation, disasters and resource use – examined at both national and international levels.",
        "projects": ""
    },
    {
        "code": "GEOG305",
        "title": "Population, Health and Society",
        "description": "The social and the spatial are deeply connected in our experience of contemporary society. This course surveys selected themes in the related fields of population, health and social geography. The links between these fields are explored with particular reference to New Zealand. The course adopts various approaches to identify and explain underlying processes and discusses the policies employed to promote or contain the consequences. ",
        "projects": ""
    },
    {
        "code": "MATHS102",
        "title": "Functioning in Mathematics",
        "description": "A preliminary introduction paper to Calculus that builds mathematical skills and develops conceptual thinking. The course acts to prepare students for further study in mathematics, and is a prerequisite for computer science majors. ",
        "projects": ""
    },
    {
        "code": "MATHS108",
        "title": "General Mathematics 1",
        "description": "A general entry paper for mathematics, important for commerce and social sciences. Topics are split over more advanced algebra and calculus concepts, acting as an extension of Year 13 grade mathematics. ",
        "projects": ""
    },
    {
        "code": "PHYSICS107",
        "title": "Planets, Stars and Galaxies",
        "description": "A general Physics paper that covers astronomy and astrophysics. The course covers a basic history of astronomy and its contemporary significance, fundamentals of our solar system, the composition of space and its different elements and what makes up a Universe. ",
        "projects": ""
    },
    {
        "code": "PHYSICS140",
        "title": "Digital Fundamentals",
        "description": "A basic introduction to digital fundamentals of physics. A compulsory paper for computer science students, the paper covers concepts such as basic logic circuits, Boolean algebra, combinational logic, truth tables and registers and memory.",
        "projects": ""
    },
    {
        "code": "THEOREL106G",
        "title": "Islam and the Contemporary World",
        "description": "A general education paper that acts as an introduction to Islam as a living and multifaceted tradition. Particular attention is drawn to how it is perceived in the contemporary world, especially in New Zealand and Australia. Topics include an overview of the Qur’an, the story of the Prophet Muhammad, the Sunni and Shia schools of thought and controversy around Sharia’s Law.",
        "projects": ""
    },
    {
        "code": "PHIL105G",
        "title": "Critical Thinking",
        "description": "A general education paper that examines critical thinking concepts and philosophical argumentation methods. The course is best understood in four key components; basic arguments, inductive arguments, abductive arguments and arguing in context. ",
        "projects": ""
    },
    {
        "code": "HISTORY242",
        "title": "Early Modern Japan 1600-1868",
        "description": "This course explores the voices and lives of Edo Japanese through the reading of primary sources in translation and a selection of secondary readings. The course is divided into three thematic parts: a general overview of the political situation in the early modern era, an examination of representative aspects of Tokugawa society and culture, and finally an exploration of the rising tensions that were a precursor to major social change in the nineteenth century. ",
        "projects": ""
    },
    {
        "code": "ANTHRO102",
        "title": "How Humans Evolve",
        "description": "The course is an introduction to Biological Anthropology the study of human and non-human primate biological variation over time, and the relationship of that variation to the worlds we inhabit: social, cultural and physical. Biological anthropologists study human evolution and human ecology at a range of different levels, from the gene to the population.",
        "projects": ""
    },
    {
        "code": "JAPANESE150",
        "title": "Exploring Japan",
        "description": "A brief introduction to modern Japanese history, political issues, culture and society. The course enables a multifaceted view of Japan – a country which is often stereotyped as a homogenous society. The relevance and significance of various historical and contemporary events are considered in order to better develop these ideas, with an emphasis on history, society and culture and literature and popular culture.",
        "projects": ""
    }
    ]
}
